Repository: bum2/manual_edd_wp_plugin
Catalog: languages/manual_edd_wp_plugin-*.po
Languages: ca

source: Transfer and other manual payments
ca: Transferència i altres pagaments manuals

source: The text of the email to inform your contributors about other payment methods
ca: El texte del email per informar els teus cofinançadors sobre altres formes de pagament

source: Email Body
ca: Cos del Email

source: The subject of the email to notify the backer
ca: L'assumpte del email de notificació al cofinançador

source: Email Subject
ca: Assumpte del Email

source: Reply-to this email address of your project
ca: Respondre a aquest email del teu projecte

source: Email From
ca: Remitent

source: The BIN code of the bank account
ca: El codi BIN del compte bancari

source: Campaign BIN
ca: BIN de la Campanya

source: The IBAN account number of the campaign
ca: El número IBAN del compte de la campanya

source: Campaign IBAN
ca: IBAN de la Campanya

source: Manual gateway Campaign Settings
ca: Configuració de la Pasarela Manual
